src-1c/DataProcessors/КонвертацияВалютыЧерезDex.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>КонвертацияВалютыЧерезDex</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Криптообменники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВИсходнойКриптовалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходнаяКриптовалюта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелеваяКриптовалюта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаОтчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src-1c/DataProcessors/КонвертацияВалютыЧерезDex/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	Если Элементы.Криптовалюты.Доступность = Истина Тогда
		
		Объект.ИсходнаяКриптовалюта = Неопределено;
		Объект.ЦелеваяКриптовалюта = Неопределено;
 
	Иначе
		Элементы.Криптовалюты.Доступность = Истина;
	КонецЕсли;       
	
	ЗаполнитьДаннымиИзТЧДокумента();
	
КонецПроцедуры  

&НаСервере
Процедура Рассчитать()            
	
	Если Объект.СуммаВИсходнойКриптовалюте = 0 Тогда
		Сообщить("Значение исходной суммы не заполнено");  
		Возврат;
	КонецЕсли;             
	
	Если Объект.ИсходнаяКриптовалюта = Объект.ЦелеваяКриптовалюта Тогда                
		ВывестиОшибкуВОтчет();  
		Возврат;
	КонецЕсли;

	ИсходныеКриптовалюты = Новый Массив;  
	ЦелевыеКриптовалюты = Новый Массив;   
	Курсы = Новый Массив;  
	Комиссии = Новый Массив; 
	Платформы = Новый Массив;
	
	Для Каждого СтрокаТЗ Из ТаблицаДокумента Цикл
	    ИсходныеКриптовалюты.Добавить(СтрокаТЗ.ИсходнаяВалюта);   
		ЦелевыеКриптовалюты.Добавить(СтрокаТЗ.ЦелеваяВалюта); 
		Курсы.Добавить(СтрокаТЗ.Курс);
		Комиссии.Добавить(СтрокаТЗ.Комиссия);
		Платформы.Добавить(СтрокаТЗ.Платформа);
	КонецЦикла;
	
    ВсеМассивыПутей = ПросчитатьВсеПути(ИсходныеКриптовалюты, ЦелевыеКриптовалюты);
	ВсегоМаксПутей = 0;
	
	Если ВсеМассивыПутей <> Неопределено И ВсеМассивыПутей.Количество() <> 0 Тогда
		МаксСумма = 0;
		МаксСчетчик = 0;
		ДанныеВсехОбменов = Новый Массив;
		ИндексыПутейСВалютамиБезКурсовСоответствие = Новый Соответствие;
		
		Для Счетчик = 0 По ВсеМассивыПутей.Количество() -1 Цикл 
			ИтогСумма = 0;
			ДанныеВсехОбменов.Добавить(ПросчитатьОбмен(ИтогСумма, ИсходныеКриптовалюты, ЦелевыеКриптовалюты, Курсы, Комиссии, ВсеМассивыПутей.Получить(Счетчик),ИндексыПутейСВалютамиБезКурсовСоответствие,Счетчик));
			
			Если ИтогСумма > МаксСумма Тогда 
				ВсегоМаксПутей = 0;
				ИндексыПутейСВалютамиБезКурсовСоответствие = Новый Соответствие;
				МаксСумма = ИтогСумма;
				МаксСчетчик = Счетчик;
			ИначеЕсли ИтогСумма = МаксСумма Тогда
				ВсегоМаксПутей = ВсегоМаксПутей + 1;
				МаксСумма = ИтогСумма;
				МаксСчетчик = Счетчик;
			КонецЕсли;
		КонецЦикла; 
		
		Колво = 0; 
		
		Для Каждого ЭлементСоответствия Из ИндексыПутейСВалютамиБезКурсовСоответствие Цикл			Колво = Колво + 1; 
			Если Колво <> ИндексыПутейСВалютамиБезКурсовСоответствие.Количество() И ЭлементСоответствия.Значение.Количество() > 0 Тогда
				Продолжить
			ИначеЕсли Колво = ИндексыПутейСВалютамиБезКурсовСоответствие.Количество() И ЭлементСоответствия.Значение.Количество() > 0 Тогда
				ВывестиОшибкуВОтчет(ЭлементСоответствия.Значение);
				Возврат;
			КонецЕсли;
		КонецЦикла;   
		
		ЗаполнитьОтчетДанными(Платформы, ИсходныеКриптовалюты, ЦелевыеКриптовалюты, ДанныеВсехОбменов.Получить(МаксСчетчик),
							ВсеМассивыПутей.Получить(МаксСчетчик), МаксСумма); 
	Иначе
		ВывестиОшибкуВОтчет();
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Функция ПросчитатьВсеПути(ИсходныеКриптовалюты, ЦелевыеКриптовалюты)
	ТекЦелевая = Объект.ЦелеваяКриптовалюта;
	ТекИсходная = Объект.ИсходнаяКриптовалюта;
	ВсеМассивыПутей = Новый Массив;
	МассивПуть = Новый Массив;
	
	ИсхКриптовалютыСоответствие = ПолучитьИнформациюПроЭлементы(ИсходныеКриптовалюты);
	ЦелКриптовалютыСоответствие = ПолучитьИнформациюПроЭлементы(ЦелевыеКриптовалюты);

	Количество = ЦелКриптовалютыСоответствие.Получить(ТекЦелевая).Количество;  
	КоличествоИсходной = ИсхКриптовалютыСоответствие.Получить(ТекИсходная).Количество;
	
		Если Количество = 1 Тогда 
			НовыйВсеМассивыПутей = ПросчитатьНовыйОдинПуть(ВсеМассивыПутей, 
														МассивПуть, 0, ТекЦелевая, ИсхКриптовалютыСоответствие, 
														ЦелКриптовалютыСоответствие, ИсходныеКриптовалюты, 
														ЦелевыеКриптовалюты);		
			
			Если НовыйВсеМассивыПутей <> Неопределено Тогда
				ВсеМассивыПутей = НовыйВсеМассивыПутей;
			Иначе
				ВывестиОшибкуВОтчет();
				Возврат Неопределено;
			КонецЕсли;
		Иначе
			Для Счетчик = 0 По Количество-1 Цикл
				НовыйПуть = Новый Массив;
				Для Каждого инд ИЗ МассивПуть Цикл
					НовыйПуть.Добавить(инд);
				КонецЦикла;
				
				НовыйТекЦелевая = ТекЦелевая;
				НовыйВсеМассивыПутей = ПросчитатьНовыйОдинПуть(ВсеМассивыПутей, НовыйПуть, Счетчик, НовыйТекЦелевая, ИсхКриптовалютыСоответствие, ЦелКриптовалютыСоответствие, ИсходныеКриптовалюты, ЦелевыеКриптовалюты);		
				
				Если НовыйВсеМассивыПутей <> Неопределено Тогда
					ВсеМассивыПутей = НовыйВсеМассивыПутей;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;  
	Возврат ВсеМассивыПутей;	
КонецФункции  

&НаСервере
Функция ПросчитатьНовыйОдинПуть(ВсеМассивыПутей, МассивПуть, СчетчикИзнач, ТекЦелевая, ИсхКриптовалютыСоответствие, ЦелКриптовалютыСоответствие, ИсходныеКриптовалюты, ЦелевыеКриптовалюты)
	Если ЦелКриптовалютыСоответствие.Получить(ТекЦелевая) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//СчетчикИзнач нужен для получения индекса повтор элемента
	Индекс = ЦелКриптовалютыСоответствие.Получить(ТекЦелевая).Индексы.Получить(СчетчикИзнач);		
 
	Если МассивПуть.Найти(Индекс) <> Неопределено ИЛИ ЦелевыеКриптовалюты.Получить(Индекс) = ИсходныеКриптовалюты.Получить(Индекс) Тогда                
		Возврат Неопределено;
	КонецЕсли;

	МассивПуть.Добавить(Индекс);	
	ТекИсходная = ИсходныеКриптовалюты.Получить(Индекс);    
	
	Если ТекИсходная = Объект.ИсходнаяКриптовалюта Тогда
		ВсеМассивыПутей.Добавить(МассивПуть);
		Возврат ВсеМассивыПутей;
	КонецЕсли;                                          
	
	ТекЦелевая = ТекИсходная;
	ТекИсходная = "";		

	Если ЦелКриптовалютыСоответствие.Получить(ТекЦелевая) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Количество = ЦелКриптовалютыСоответствие.Получить(ТекЦелевая).Количество;   
	
	Если Количество = 1 Тогда 
		Индекс = ЦелКриптовалютыСоответствие.Получить(ТекЦелевая).Индексы.Получить(0); 
		
		Если МассивПуть.Найти(Индекс) <> Неопределено ИЛИ ЦелевыеКриптовалюты.Получить(Индекс) = ИсходныеКриптовалюты.Получить(Индекс) Тогда                
			Возврат Неопределено;
		КонецЕсли; 
		
		ТекИсходная = ИсходныеКриптовалюты.Получить(Индекс);
		МассивПуть.Добавить(Индекс);  
	Иначе
		Для Счетчик = 0 По Количество -1 Цикл
			НовыйПуть = Новый Массив;
			Для Каждого инд ИЗ МассивПуть Цикл
				НовыйПуть.Добавить(инд);
			КонецЦикла;
			
			НовыйТекЦелевая = ТекЦелевая;
			НовыйВсеМассивыПутей = ПросчитатьНовыйОдинПуть(ВсеМассивыПутей, НовыйПуть, Счетчик, НовыйТекЦелевая, ИсхКриптовалютыСоответствие, ЦелКриптовалютыСоответствие, ИсходныеКриптовалюты, ЦелевыеКриптовалюты);		
			
			Если НовыйВсеМассивыПутей<> Неопределено Тогда
				ВсеМассивыПутей = НовыйВсеМассивыПутей;
			КонецЕсли;
		КонецЦикла;
		
		Возврат ВсеМассивыПутей;
	КонецЕсли;
		Для Счетчик1 = 0 По ИсходныеКриптовалюты.Количество() Цикл
	
			Если ТекИсходная = Объект.ИсходнаяКриптовалюта  Тогда
				Прервать;
			КонецЕсли;
			
			Индекс = ЦелевыеКриптовалюты.Найти(ТекИсходная);
			
			Если Индекс = Неопределено ИЛИ ТекИсходная = Объект.ЦелеваяКриптовалюта ИЛИ МассивПуть.Найти(Индекс) <> Неопределено 
										ИЛИ ЦелевыеКриптовалюты.Получить(Индекс) = ИсходныеКриптовалюты.Получить(Индекс) Тогда                
				Возврат Неопределено;
			КонецЕсли;

			
			МассивПуть.Добавить(Индекс);
			ТекЦелевая = ТекИсходная;
			ТекИсходная = ИсходныеКриптовалюты.Получить(Индекс);
	КонецЦикла;
	
	ВсеМассивыПутей.Добавить(МассивПуть);
	Возврат ВсеМассивыПутей;
КонецФункции

#Область ПолучениеДанных
&НаСервере
Процедура ЗаполнитьДаннымиИзТЧДокумента()
    ЭтотОбъект.ТаблицаДокумента.Очистить();

    Для Каждого СтрТЧ Из Объект.Документ.ВалютныеПары Цикл
        НоваяСтрока = ЭтотОбъект.ТаблицаДокумента.Добавить();
        НоваяСтрока.ИсходнаяВалюта = СтрТЧ.КриптовалютаИсходная;
        НоваяСтрока.ЦелеваяВалюта = СтрТЧ.КриптовалютаЦелевая;
        НоваяСтрока.Курс = СтрТЧ.Курс;
        НоваяСтрока.Комиссия = СтрТЧ.Комиссия;
		НоваяСтрока.Платформа = СтрТЧ.Платформа;
	КонецЦикла;

    ТаблицаЗначений = ЭтотОбъект.ТаблицаДокумента;

    Элементы.ИсходнаяКриптовалюта.СписокВыбора.Очистить();
    Элементы.ЦелеваяКриптовалюта.СписокВыбора.Очистить();
	
	Для Каждого СтрокаТЗ Из ТаблицаЗначений Цикл  
	    ИсходнаяКрипт = СтрокаТЗ.ИсходнаяВалюта;
	    Если Элементы.ИсходнаяКриптовалюта.СписокВыбора.НайтиПоЗначению(ИсходнаяКрипт) = Неопределено Тогда
	        Элементы.ИсходнаяКриптовалюта.СписокВыбора.Добавить(ИсходнаяКрипт);
		КонецЕсли;
		
		ЦелеваяКрипт = СтрокаТЗ.ЦелеваяВалюта;
	    Если Элементы.ЦелеваяКриптовалюта.СписокВыбора.НайтиПоЗначению(ЦелеваяКрипт) = Неопределено Тогда
	        Элементы.ЦелеваяКриптовалюта.СписокВыбора.Добавить(ЦелеваяКрипт);
	    КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИнформациюПроЭлементы(ИсходныйМассив)
	
	СоответствиеЭлементов = Новый Соответствие;
	
	Для Индекс = 0 По ИсходныйМассив.Количество() - 1 Цикл
		ТекЭлемент = ИсходныйМассив.Получить(Индекс);
		ИнформацияЭлемента = СоответствиеЭлементов.Получить(ТекЭлемент);
		
		Если ИнформацияЭлемента = Неопределено Тогда
			ИнформацияЭлемента = Новый Структура;
			ИнформацияЭлемента.Вставить("Количество", 1);
			ИнформацияЭлемента.Вставить("Индексы", Новый Массив);
			ИнформацияЭлемента.Индексы.Добавить(Индекс);
			
			СоответствиеЭлементов.Вставить(ТекЭлемент, ИнформацияЭлемента);
		Иначе
			ИнформацияЭлемента.Количество = ИнформацияЭлемента.Количество + 1;
			ИнформацияЭлемента.Индексы.Добавить(Индекс); 
		КонецЕсли;
	КонецЦикла;	
	
	Возврат СоответствиеЭлементов;
	
КонецФункции
#КонецОбласти

#Область Отчет
&НаСервере
Функция ПросчитатьОбмен(ИтогСумма, ИсходныеКриптовалюты, ЦелевыеКриптовалюты, Курсы, Комиссии, МассивПути,ИндексыПутейСВалютамиБезКурсовСоответствие, индексПути)
	ДанныеОбмена = Новый Массив;	
	ТекСумма = Объект.СуммаВИсходнойКриптовалюте;
	ВалютыБезКурсовМассив = Новый Массив;
	
	Для Счетчик = 0 По МассивПути.Количество()-1 Цикл 
		Индекс = МассивПути.Получить(МассивПути.ВГраница()-Счетчик);  
		
		Если Курсы.Получить(Индекс) = Неопределено ИЛИ Курсы.Получить(Индекс) = 0 Тогда
			ВалютыБезКурсовМассив.Добавить(ИсходныеКриптовалюты.Получить(Индекс));	
		КонецЕсли;      
		
		ТекСумма = ТекСумма*Курсы.Получить(Индекс)*(1-(Комиссии.Получить(Индекс)/100));
		ДанныеОбмена.Добавить(ТекСумма);
	КонецЦикла;
	
	ИтогСумма = ТекСумма;
	ИндексыПутейСВалютамиБезКурсовСоответствие.Вставить(индексПути, ВалютыБезКурсовМассив);
	Возврат ДанныеОбмена;
КонецФункции	
	
&НаСервере
Процедура ЗаполнитьОтчетДанными(Платформы, ИсходныеКриптовалюты, ЦелевыеКриптовалюты, МассивОбмена, МассивПути, ИтоговаяСумма)
	ЭтотОбъект.ТаблицаОтчет.Очистить();
	Если МассивПути.Количество() <> 0 Тогда
		Объект.СтрокаОтчет = "Исходная криптовалюта: " + Объект.ИсходнаяКриптовалюта + Символы.ПС + 
								 "Сумма в исходной криптовалюте: " + Формат(Объект.СуммаВИсходнойКриптовалюте,"ЧДЦ=8; ЧН=")+ Символы.ПС +
								 "Целевая криптовалюта: " + Объект.ЦелеваяКриптовалюта + Символы.ПС + 
								 "Итоговая сумма в целевой криптовалюты: " + Формат(ИтоговаяСумма,"ЧДЦ=8; ЧН=") + Символы.ПС + 
								 "По информации документа: № " + Объект.Документ.Номер + " от " + Объект.Документ.Дата + Символы.ПС + 
								 "Источник: " + Объект.Документ.Источник + Символы.ПС +  
								 "Возможность конвертации: да" + Символы.ПС + 
								 "Количество обменов: " + МассивПути.Количество() + Символы.ПС + 
								 "Пошагавая цепочка обменов: ";
		Для Счетчик = 0 По МассивПути.Количество() - 1 Цикл
			ИндексМассиваПути = МассивПути.Получить(МассивПути.ВГраница() - Счетчик);
			Строка = ЭтотОбъект.ТаблицаОтчет.Добавить();
			Строка.Номер = Счетчик + 1;
			Строка.ПлатформаПротокол = Платформы.Получить(ИндексМассиваПути);
			Строка.КриптовалютаИсходная = ИсходныеКриптовалюты.Получить(ИндексМассиваПути);
			Строка.КриптовалютаЦелевая = ЦелевыеКриптовалюты.Получить(ИндексМассиваПути);
			Строка.РезультатОбмена = МассивОбмена.Получить(Счетчик); 
		КонецЦикла;
		Элементы.ТаблицаОтчет.Видимость = Истина;
		
	Иначе

								 
	КонецЕсли;
    Сообщить("Отчет сформирован и ожидает вас на странице Отчет");
	Элементы.СтраницаОтчет.Доступность = Истина;

КонецПроцедуры

&НаСервере
Процедура ВывестиОшибкуВОтчет(КрипротовалютыНенайденныхКурсыМассив = Неопределено)
	Элементы.ТаблицаОтчет.Видимость = Ложь;  
	Элементы.СтраницаОтчет.Доступность = Истина;

	Текс = "Исходная криптовалюта: " + Объект.ИсходнаяКриптовалюта + Символы.ПС + 
							 "Целевая криптовалюта: " + Объект.ЦелеваяКриптовалюта + Символы.ПС + 
							 "По информации документа: № " + Объект.Документ.Номер + " от " + Объект.Документ.Дата + Символы.ПС + 
							 "Источник: " + Объект.Документ.Источник + Символы.ПС +  
							 "Возможность конвертации: нет" + Символы.ПС +   
							 "Причина: не удалось найти ";
	Если КрипротовалютыНенайденныхКурсыМассив = Неопределено Тогда
		Текс = Текс + "цепочку обменов";
	Иначе
		Текс = Текс + " курсы криптовалют: ";
		Для Каждого Криптовалюты Из КрипротовалютыНенайденныхКурсыМассив Цикл
			Текс = Текс + Криптовалюты + ", ";
		КонецЦикла;
		Текс = Лев(Текс, СтрДлина(Текс) - 2);
	КонецЕсли;        
	
	Объект.СтрокаОтчет = Текс;
	    Сообщить("Отчет сформирован и ожидает вас на странице Отчет");
КонецПроцедуры
#КонецОбласти

#Область Проверки

&НаКлиенте
Процедура ЦелеваяКриптовалютаПриИзменении(Элемент)
	
	Проверка();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходнаяКриптовалютаПриИзменении(Элемент)
	
	Проверка();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаВИсходнойКриптовалютеПриИзменении(Элемент)

	Проверка(); 

КонецПроцедуры

&НаКлиенте
Процедура РасчитатьКоманда(Команда)
	
	Проверка()
	
КонецПроцедуры 


&НаКлиенте
Процедура Проверка()
	
	Если ЗначениеЗаполнено(Объект.ИсходнаяКриптовалюта) И ЗначениеЗаполнено(Объект.ЦелеваяКриптовалюта) Тогда
		Элементы.РасчитатьКоманда.Доступность = Истина;
		Рассчитать(); 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПерехода(ОбъектПерехода, СтандартнаяОбработка)     
	
	ЗаполнитьДаннымиИзТЧДокумента();

КонецПроцедуры
#КонецОбласти
